gillwei/XMAX_rt1172/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_SD_B1_02 (coord C15), TFT_CONNECTED */
/* Routed pin properties */
#define BOARD_INITPINS_TFT_CONNECTED_PERIPHERAL                           GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_TFT_CONNECTED_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TFT_CONNECTED_CHANNEL                                  5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TFT_CONNECTED_GPIO                                 GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TFT_CONNECTED_GPIO_PIN                                 5U   /*!< GPIO pin number */
#define BOARD_INITPINS_TFT_CONNECTED_GPIO_PIN_MASK                    (1U << 5U)   /*!< GPIO pin mask */

/* GPIO_SD_B1_01 (coord D15), TFT_ASIL */
/* Routed pin properties */
#define BOARD_INITPINS_TFT_ASIL_PERIPHERAL                                GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_TFT_ASIL_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TFT_ASIL_CHANNEL                                       4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TFT_ASIL_GPIO                                      GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TFT_ASIL_GPIO_PIN                                      4U   /*!< GPIO pin number */
#define BOARD_INITPINS_TFT_ASIL_GPIO_PIN_MASK                         (1U << 4U)   /*!< GPIO pin mask */

/* WAKEUP (coord T8), IGN_WAKE */
/* Routed pin properties */
#define BOARD_INITPINS_IGN_WAKE_PERIPHERAL                                GPIO13   /*!< Peripheral name */
#define BOARD_INITPINS_IGN_WAKE_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_IGN_WAKE_CHANNEL                                       0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_IGN_WAKE_GPIO                                      GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_IGN_WAKE_GPIO_PIN                                      0U   /*!< GPIO pin number */
#define BOARD_INITPINS_IGN_WAKE_GPIO_PIN_MASK                         (1U << 0U)   /*!< GPIO pin mask */

/* GPIO_AD_10 (coord R17), VDD_3.3V_PGOOD */
/* Routed pin properties */
#define BOARD_INITPINS_VDD_3V3_PGOOD_PERIPHERAL                            GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_VDD_3V3_PGOOD_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_VDD_3V3_PGOOD_CHANNEL                                  9U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_VDD_3V3_PGOOD_GPIO                                  GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_VDD_3V3_PGOOD_GPIO_PIN                                 9U   /*!< GPIO pin number */
#define BOARD_INITPINS_VDD_3V3_PGOOD_GPIO_PIN_MASK                    (1U << 9U)   /*!< GPIO pin mask */

/* GPIO_AD_11 (coord P16), 5V_CAN_PGOOD */
/* Routed pin properties */
#define BOARD_INITPINS_CAN_PGOOD_PERIPHERAL                                GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_CAN_PGOOD_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CAN_PGOOD_CHANNEL                                     10U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAN_PGOOD_GPIO                                      GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CAN_PGOOD_GPIO_PIN                                    10U   /*!< GPIO pin number */
#define BOARD_INITPINS_CAN_PGOOD_GPIO_PIN_MASK                       (1U << 10U)   /*!< GPIO pin mask */

/* GPIO_AD_27 (coord N16), 5V_CAN_EN */
/* Routed pin properties */
#define BOARD_INITPINS_CAN_EN_PERIPHERAL                                   GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_CAN_EN_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CAN_EN_CHANNEL                                        26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAN_EN_GPIO                                         GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CAN_EN_GPIO_PIN                                       26U   /*!< GPIO pin number */
#define BOARD_INITPINS_CAN_EN_GPIO_PIN_MASK                          (1U << 26U)   /*!< GPIO pin mask */

/* GPIO_SD_B2_01 (coord J14), DEBUG_LED */
/* Routed pin properties */
#define BOARD_INITPINS_DEBUG_LED_PERIPHERAL                               GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_DEBUG_LED_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DEBUG_LED_CHANNEL                                     10U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DEBUG_LED_GPIO                                     GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DEBUG_LED_GPIO_PIN                                    10U   /*!< GPIO pin number */
#define BOARD_INITPINS_DEBUG_LED_GPIO_PIN_MASK                       (1U << 10U)   /*!< GPIO pin mask */

/* GPIO_AD_28 (coord L17), CAN_STBY */
/* Routed pin properties */
#define BOARD_INITPINS_CAN_STBY_PERIPHERAL                                 GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_CAN_STBY_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_CAN_STBY_CHANNEL                                      27U   /*!< Signal channel */

