gillwei/XMAX_rt1172/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CAN_STBY_GPIO                                       GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_CAN_STBY_GPIO_PIN                                     27U   /*!< GPIO pin number */
#define BOARD_INITPINS_CAN_STBY_GPIO_PIN_MASK                        (1U << 27U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_04 (coord M1), HW_ID1 */
/* Routed pin properties */
#define BOARD_INITPINS_HW_ID1_PERIPHERAL                                   GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_HW_ID1_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_HW_ID1_CHANNEL                                        14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_HW_ID1_GPIO                                         GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_HW_ID1_GPIO_PIN                                       14U   /*!< GPIO pin number */
#define BOARD_INITPINS_HW_ID1_GPIO_PIN_MASK                          (1U << 14U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_05 (coord N1), HW_ID2 */
/* Routed pin properties */
#define BOARD_INITPINS_HW_ID2_PERIPHERAL                                   GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_HW_ID2_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_HW_ID2_CHANNEL                                        15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_HW_ID2_GPIO                                         GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_HW_ID2_GPIO_PIN                                       15U   /*!< GPIO pin number */
#define BOARD_INITPINS_HW_ID2_GPIO_PIN_MASK                          (1U << 15U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_08 (coord P1), HW_ID3 */
/* Routed pin properties */
#define BOARD_INITPINS_HW_ID3_PERIPHERAL                                   GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_HW_ID3_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_HW_ID3_CHANNEL                                        18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_HW_ID3_GPIO                                         GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_HW_ID3_GPIO_PIN                                       18U   /*!< GPIO pin number */
#define BOARD_INITPINS_HW_ID3_GPIO_PIN_MASK                          (1U << 18U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_03 (coord R1), HW_ID0 */
/* Routed pin properties */
#define BOARD_INITPINS_HW_ID0_PERIPHERAL                                   GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_HW_ID0_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_HW_ID0_CHANNEL                                        13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_HW_ID0_GPIO                                         GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_HW_ID0_GPIO_PIN                                       13U   /*!< GPIO pin number */
#define BOARD_INITPINS_HW_ID0_GPIO_PIN_MASK                          (1U << 13U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_12 (coord M2), SKU_ID2 */
/* Routed pin properties */
#define BOARD_INITPINS_SKU_ID2_PERIPHERAL                                  GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SKU_ID2_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SKU_ID2_CHANNEL                                       22U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SKU_ID2_GPIO                                        GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SKU_ID2_GPIO_PIN                                      22U   /*!< GPIO pin number */
#define BOARD_INITPINS_SKU_ID2_GPIO_PIN_MASK                         (1U << 22U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_09 (coord N2), SKU_ID0 */
/* Routed pin properties */
#define BOARD_INITPINS_SKU_ID0_PERIPHERAL                                  GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SKU_ID0_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SKU_ID0_CHANNEL                                       19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SKU_ID0_GPIO                                        GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SKU_ID0_GPIO_PIN                                      19U   /*!< GPIO pin number */
#define BOARD_INITPINS_SKU_ID0_GPIO_PIN_MASK                         (1U << 19U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_16 (coord P2), SKU_ID3 */
/* Routed pin properties */
#define BOARD_INITPINS_SKU_ID3_PERIPHERAL                                  GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SKU_ID3_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SKU_ID3_CHANNEL                                       26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SKU_ID3_GPIO                                        GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SKU_ID3_GPIO_PIN                                      26U   /*!< GPIO pin number */
#define BOARD_INITPINS_SKU_ID3_GPIO_PIN_MASK                         (1U << 26U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_10 (coord R2), SKU_ID1 */
/* Routed pin properties */
#define BOARD_INITPINS_SKU_ID1_PERIPHERAL                                  GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_SKU_ID1_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SKU_ID1_CHANNEL                                       20U   /*!< Signal channel */

