gillwei/XMAX_rt1172/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SKU_ID1_GPIO                                        GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SKU_ID1_GPIO_PIN                                      20U   /*!< GPIO pin number */
#define BOARD_INITPINS_SKU_ID1_GPIO_PIN_MASK                         (1U << 20U)   /*!< GPIO pin mask */

/* GPIO_AD_08 (coord R15), BT_RST_N */
/* Routed pin properties */
#define BOARD_INITPINS_BT_RST_N_PERIPHERAL                                 GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_BT_RST_N_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_BT_RST_N_CHANNEL                                       7U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BT_RST_N_GPIO                                       GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_BT_RST_N_GPIO_PIN                                      7U   /*!< GPIO pin number */
#define BOARD_INITPINS_BT_RST_N_GPIO_PIN_MASK                         (1U << 7U)   /*!< GPIO pin mask */

/* GPIO_SD_B1_03 (coord B17), TFT_RESET */
/* Routed pin properties */
#define BOARD_INITPINS_TFT_RESET_PERIPHERAL                               GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_TFT_RESET_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TFT_RESET_CHANNEL                                      6U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TFT_RESET_GPIO                                     GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TFT_RESET_GPIO_PIN                                     6U   /*!< GPIO pin number */
#define BOARD_INITPINS_TFT_RESET_GPIO_PIN_MASK                        (1U << 6U)   /*!< GPIO pin mask */

/* GPIO_AD_29 (coord M17), TFT_BL_PWM */
/* Routed pin properties */
#define BOARD_INITPINS_TFT_BL_PWM_PERIPHERAL                             FLEXIO2   /*!< Peripheral name */
#define BOARD_INITPINS_TFT_BL_PWM_SIGNAL                                      IO   /*!< Signal name */
#define BOARD_INITPINS_TFT_BL_PWM_CHANNEL                                    29U   /*!< Signal channel */

/* GPIO_SD_B1_00 (coord B16), TFT_BL_EN */
/* Routed pin properties */
#define BOARD_INITPINS_TFT_BL_EN_PERIPHERAL                               GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_TFT_BL_EN_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TFT_BL_EN_CHANNEL                                      3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TFT_BL_EN_GPIO                                     GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TFT_BL_EN_GPIO_PIN                                     3U   /*!< GPIO pin number */
#define BOARD_INITPINS_TFT_BL_EN_GPIO_PIN_MASK                        (1U << 3U)   /*!< GPIO pin mask */

/* GPIO_AD_04 (coord M13), WDOG_B */
/* Routed pin properties */
#define BOARD_INITPINS_WDOG_B_PERIPHERAL                                   GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_WDOG_B_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_WDOG_B_CHANNEL                                         3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_WDOG_B_GPIO                                         GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_WDOG_B_GPIO_PIN                                        3U   /*!< GPIO pin number */
#define BOARD_INITPINS_WDOG_B_GPIO_PIN_MASK                           (1U << 3U)   /*!< GPIO pin mask */

/* GPIO_SD_B1_04 (coord B15), BT_RST_N_2 */
/* Routed pin properties */
#define BOARD_INITPINS_BT_RST_N_2_PERIPHERAL                              GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_BT_RST_N_2_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_BT_RST_N_2_CHANNEL                                     7U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BT_RST_N_2_GPIO                                    GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_BT_RST_N_2_GPIO_PIN                                    7U   /*!< GPIO pin number */
#define BOARD_INITPINS_BT_RST_N_2_GPIO_PIN_MASK                       (1U << 7U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

/* GPIO_DISP_B1_01 (coord D13), TFT_RGB_DE */
/* Routed pin properties */
#define BOARD_INITLCDIFPINS_LCDIF_ENABLE_PERIPHERAL                        LCDIF   /*!< Peripheral name */
#define BOARD_INITLCDIFPINS_LCDIF_ENABLE_SIGNAL                     lcdif_enable   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLcdifPins(void);               /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
